Merge pull request #4763 from esl/docs-migrate-to-zensical
MIM-2768 Migrate the docs to Zensical
